import "./scss/main.scss";
import burgerMenu from "./js/burger";
import slider from "./js/slider";
import pagination from "./js/pagination";

// import "./assets/images/pets-jennifer.png";
// console.log(
//   "Требования к вёрстке: \n 1. Вёрстка страницы Main соответствует макету при ширине экрана 1280px - true  \n 2. Вёрстка страницы Main соответствует макету при ширине экрана 768px: +14 - true \n 3. Вёрстка страницы Main соответствует макету при ширине экрана 320px: +14 - true \n 4. Вёрстка страницы Pets соответствует макету при ширине экрана 1280px: +6 - true \n 5. Вёрстка страницы Pets соответствует макету при ширине экрана 768px: +6 - true \n 6. Вёрстка страницы Pets соответствует макету при ширине экрана 320px: +6 - true \n 7. Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки, справа от отдельных блоков не появляются белые поля. Весь контент страницы при этом сохраняется: не обрезается и не удаляется: +20 - true \n 8. Верстка резиновая: при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции - true \n 9. При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню: +4 - true \n 10. Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/ : +8 - true \n Total Score: 100/100"
// );

const question = confirm(
  "Привет!, если не трудно, проверьте мою работу после 12.04 , немного не успел, доделываю ;)"
);
if (question === true) {
  alert("Большое спасибо!!;)");
} else {
  alert("сегодня доделаю, спасибо за понимание");
}
